package com.company.tujia;
//
//题目描述：
//        在中国有N座城市和M条无向道路,第i条道路连接Ai和Bi，长度为Ci。 马可波罗想要在中国访问R座城市(r1,r2...rR)(不一定按照这个顺序)。 他可以制定一条旅行路线，这条路线一定要包括这R座城市。 现在问如何制定这条旅行路线，使得经过的总长度最小？
//
//        提示：输入样例效果如图所示
//
//
//
//        输入
//        N M R r1 r2 ... rR A1 B1 C1 A2 B2 C2 ....... AM BM CM 其中2<=N<=200, 1<=M<=5000, 2<=R<=min(22,N), Ci<=10000 保证无重边。
//
//        输出
//        输出一行表示旅行路线最小的长度。
//
//
//        样例输入
//        4 6 3
//        2 3 4
//        1 2 4
//        2 3 3
//        4 3 1
//        1 4 1
//        4 2 2
//        3 1 6
//        样例输出
//        3
public class Test_2 {
    public static void main(String[] args) {

    }
}
